In [20]:
import pandas as pd
from IPython.display import FileLink, FileLinks
uploaded_file = FileLink('E:\Data analyst\Project\Data cleaning\sample_data.csv')
data = pd.read_csv('E:\Data analyst\Project\Data cleaning\sample_data.csv', encoding='latin1')

In [8]:
data.head()

,ID,Name,Age,Gender,Phone,Email,Address,Credit_Score,Last_Purchase_Date
0,177,James Rhodes,52.0,M,504.554.3776,fostergina@example.com,"3892 Kathleen Square Apt. 817\nLake Jill, AZ 1...",unknown,19.09.2021
1,984,Kimberly Crawford,56.0,NaN,NaN,krussell@example.com,"51987 Bush Ranch Suite 663\nScottton, PA 03611",700,25.02.2023
2,722,Karen Walker,59.0,M,NaN,kiarapeters@example.net,"29197 Austin Flat\nEast Robertmouth, NE 42823",870,17.09.2021
3,870,Sandra Smith,NaN,M,479.487.9989x242,rodney99@example.net,"185 Le Villages\nPort Johnside, WY 42113",unknown,24.11.2021
4,664,Alison Walsh,77.0,M,001-879-250-3309,denglish@example.com,"295 Matthew Inlet Suite 676\nJohnsonland, NC 4...",unknown,08.05.2022

In [9]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 15 entries, 0 to 14
Data columns (total 9 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   ID                  15 non-null     int64
 1   Name                15 non-null     object
 2   Age                 12 non-null     float64
 3   Gender              13 non-null     object
 4   Phone               13 non-null     object
 5   Email               15 non-null     object
 6   Address             14 non-null     object
 7   Credit_Score        15 non-null     object
 8   Last_Purchase_Date  14 non-null     object
dtypes: float64(1), int64(1), object(7)
memory usage: 1.2+ KB

In [15]:
data.head()

,ID,Name,Age,Gender,Phone,Email,Address,Credit_Score,Last_Purchase_Date
0,177,James Rhodes,None,M,504.554.3776,fostergina@example.com,"3892 Kathleen Square Apt. 817\nLake Jill, AZ 1...",unknown,19.09.2021
1,984,Kimberly Crawford,None,NaN,NaN,krussell@example.com,"51987 Bush Ranch Suite 663\nScottton, PA 03611",700,25.02.2023
2,722,Karen Walker,None,M,NaN,kiarapeters@example.net,"29197 Austin Flat\nEast Robertmouth, NE 42823",870,17.09.2021
3,870,Sandra Smith,None,M,479.487.9989x242,rodney99@example.net,"185 Le Villages\nPort Johnside, WY 42113",unknown,24.11.2021
4,664,Alison Walsh,None,M,001-879-250-3309,denglish@example.com,"295 Matthew Inlet Suite 676\nJohnsonland, NC 4...",unknown,08.05.2022

In [21]:
data['Age']

0     52.0
1     56.0
2     59.0
3      NaN
4     77.0
5     41.0
6     58.0
7      NaN
8      NaN
9     41.0
10    78.0
11    42.0
12    40.0
13    43.0
14    30.0
Name: Age, dtype: float64

In [23]:
data['Age'] = data['Age'].astype('Int64')
median_age = data['Age'].median()
median_age=round(median_age)
data['Age'].fillna(median_age, inplace=True)

In [24]:
data['Age']

0     52
1     56
2     59
3     48
4     77
5     41
6     58
7     48
8     48
9     41
10    78
11    42
12    40
13    43
14    30
Name: Age, dtype: Int64

In [25]:
data['Gender'].fillna('Unknown', inplace=True)
data['Phone'].fillna('Unknown', inplace=True)
data['Address'].fillna('Unknown', inplace=True)

In [26]:
data['Gender']

0           M
1     Unknown
2           M
3           M
4           M
5           M
6           F
7           F
8           M
9     Unknown
10          M
11          M
12          F
13          M
14          F
Name: Gender, dtype: object

In [27]:
data['Phone']

0             504.554.3776
1                  Unknown
2                  Unknown
3         479.487.9989x242
4         001-879-250-3309
5         510-232-7358x300
6             881.432.9428
7               2879941085
8      (695)406-9894x90477
9               5716794807
10           (213)445-6777
11    +1-400-696-8787x6689
12     +1-906-322-0072x276
13           (693)989-4358
14            357.864.0856
Name: Phone, dtype: object

In [28]:
data['Address']

0     3892 Kathleen Square Apt. 817\nLake Jill, AZ 1...
1        51987 Bush Ranch Suite 663\nScottton, PA 03611
2         29197 Austin Flat\nEast Robertmouth, NE 42823
3              185 Le Villages\nPort Johnside, WY 42113
4     295 Matthew Inlet Suite 676\nJohnsonland, NC 4...
5       7639 Farmer Park Apt. 847\nNew Steven, MA 50197
6            05765 Jennifer Creek\nCamposland, KS 85868
7        8243 Burch Fords\nNorth Kennethhaven, WY 90915
8          59692 Lopez Crossing\nNorth Hannah, WY 99739
9                                               Unknown
10    108 Collins Villages Apt. 979\nEast Stephanie,...
11    786 Sarah Islands Suite 239\nSchmidtside, PR 0...
12              260 Dunlap Pike\nEscobarville, AR 49939
13       3529 Stephen Greens\nNorth Wendyfort, KS 86983
14    45618 Torres Underpass Suite 584\nSuzanneville...
Name: Address, dtype: object

In [30]:
most_recent_date=pd.to_datetime(data['Last_Purchase_Date']).max()
data['Last_Purchase_Date'].fillna(most_recent_date,inplace=True)

C:\Users\Banu\AppData\Local\Temp\ipykernel_27364\3008408213.py:1: UserWarning: Parsing dates in DD/MM/YYYY format when dayfirst=False (the default) was specified. This may lead to inconsistently parsed dates! Specify a format to ensure consistent parsing.
  most_recent_date=pd.to_datetime(data['Last_Purchase_Date']).max()

In [31]:
data['Last_Purchase_Date']

0              19.09.2021
1              25.02.2023
2              17.09.2021
3              24.11.2021
4              08.05.2022
5              31.01.2023
6              17.07.2022
7     2023-10-04 00:00:00
8              22.11.2021
9              10.04.2023
10             27.11.2021
11             31.03.2023
12             27.02.2022
13             31.01.2023
14             25.06.2023
Name: Last_Purchase_Date, dtype: object

In [32]:
data['Credit_Score']=pd.to_numeric(data['Credit_Score'],errors='coerce')
mean_credit_score=data['Credit_Score'].mean()
data['Credit_Score'].fillna(mean_credit_score,inplace=True)

In [33]:
data['Credit_Score']

0     775.916667
1     700.000000
2     870.000000
3     775.916667
4     775.916667
5     798.000000
6     842.000000
7     793.000000
8     865.000000
9     855.000000
10    715.000000
11    844.000000
12    656.000000
13    832.000000
14    541.000000
Name: Credit_Score, dtype: float64

In [34]:
data.drop_duplicates(inplace=True)
print(data.head())

    ID               Name  Age   Gender             Phone  \
0  177       James Rhodes   52        M      504.554.3776
1  984  Kimberly Crawford   56  Unknown           Unknown
2  722       Karen Walker   59        M           Unknown
3  870       Sandra Smith   48        M  479.487.9989x242
4  664       Alison Walsh   77        M  001-879-250-3309

                     Email                                            Address  \
0   fostergina@example.com  3892 Kathleen Square Apt. 817\nLake Jill, AZ 1...
1     krussell@example.com     51987 Bush Ranch Suite 663\nScottton, PA 03611
2  kiarapeters@example.net      29197 Austin Flat\nEast Robertmouth, NE 42823
3     rodney99@example.net           185 Le Villages\nPort Johnside, WY 42113
4     denglish@example.com  295 Matthew Inlet Suite 676\nJohnsonland, NC 4...

   Credit_Score Last_Purchase_Date
0    775.916667         19.09.2021
1    700.000000         25.02.2023
2    870.000000         17.09.2021
3    775.916667         24.11.2021
4    775.916667         08.05.2022

In [37]:
df=pd.DataFrame(data)
file_path = 'cleaned_sample_data.csv'
df.to_csv(file_path,index=False)